
Функция ПолучитьСписокОрганизаций()
	СписокОрганизаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипМетаданных = "Справочники";
		API3_ref = Новый Структура;
		API3_ref.Вставить("ИдИС",			СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()) );
		API3_ref.Вставить("ТипИС",			ТипМетаданных );
		API3_ref.Вставить("ИмяИС",			"Организации" );
		API3_ref.Вставить("ini_name",		"СинхВыгрузка_Организации" );
		API3_ref.Вставить("Название",		СокрЛП(ВыборкаДетальныеЗаписи.Ссылка) );
		API3_ref.Вставить("_print_forms",	Неопределено);
		СписокОрганизаций.Добавить(API3_ref);			
	КонецЦикла;
	
	Возврат СписокОрганизаций;
КонецФункции

Функция ПриСозданииНовогоПодключения(connection_info) Экспорт
	СписокОрганизаций = ПолучитьСписокОрганизаций(); 
	ПараметрыВызова = Новый Структура("ini_name, object, endpoint, params, operation_uuid, connection_uuid", 
		"Документы_send", 
		Новый Структура("list_doc_ref", СписокОрганизаций), 
		Неопределено,
		Неопределено,
		Строка(Новый УникальныйИдентификатор()),
		connection_info["ConnectionId"]);
	Результат = API_BLOCKLY_RUN(ПараметрыВызова);	
	
	Для каждого Элем из connection_info["ExtSysSettings"] Цикл
		ИмяИни = СтрЗаменить(Элем.Ключ, "Blockly_", "");
		Если Найти(ИмяИни, "predefine") > 0 Тогда
			Попытка
				ПараметрыВызова = Новый Структура("ini_name, object, endpoint, params, operation_uuid, connection_uuid", 
					ИмяИни, 
					Новый Структура("object", Неопределено), 
					Неопределено,
					Неопределено,
					Строка(Новый УникальныйИдентификатор()),
					connection_info["ConnectionId"]);
				result	= API_BLOCKLY_RUN(ПараметрыВызова);
				Если result["status"] = "complete" Тогда
					Если ТипЗнч(result["data"]) = Тип("Массив") Тогда 
						Для каждого _data из result["data"] Цикл
							local_helper_extsyncdoc_write_predefined(context["params"], context["operation"]["connection_uuid"], _data["Type"], _data["ClientType"], _data["Objects"]);	
						КонецЦикла;	
					Иначе	
						local_helper_extsyncdoc_write_predefined(context["params"], context["operation"]["connection_uuid"], result["data"]["Type"], result["data"]["ClientType"], result["data"]["Objects"]);  
					КонецЕсли;  
				ИначеЕсли result["status"] = "error" Тогда
					ВызватьИсключение NewExtExceptionСтрока(,"Не удалость загрузить предопределенные данные - " + ИмяИни, "command_processpredefineobject");	
				КонецЕсли;	
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Объект не содержит необходимый параметр"));
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;	
КонецФункции

