Функция СведенияОВнешнейОбработке() Экспорт
	
	ОбработкаНаименование	= ЭтотОбъект.Метаданные().Имя;
	БезопасныйРежим			= Ложь;
	ОбработкаВерсия 		= ПолучитьИмяФайлаИНомерТекущейВерсии()[1];
	ВерсияБСП		 		= "2.4.5.71";
	
	//КОД для БСП, Рекомендовано к прохождению аудита FRESH 
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	ПараметрыРегистрации.Вставить("Вид", 				ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Наименование",		ОбработкаНаименование);
	ПараметрыРегистрации.Вставить("Версия",				ОбработкаВерсия);
	ПараметрыРегистрации.Вставить("БезопасныйРежим",	БезопасныйРежим);
	ПараметрыРегистрации.Вставить("Информация", 		ОбработкаНаименование);
	
	//Возможность открытия новой формы
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'SABY'");
	НоваяКоманда.Идентификатор = "SABY";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Выполнить автоматические операции'");
	НоваяКоманда.Идентификатор = "АвтоматическиеОперации";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
