Функция СведенияОВнешнейОбработке() Экспорт
	
		
	ОбработкаНаименование	= ЭтотОбъект.Метаданные().Имя;
	БезопасныйРежим			= Ложь;
	ОбработкаВерсия 		= ПолучитьИмяФайлаИНомерТекущейВерсии()[1];
		
	//КОД для БСП, Рекомендовано к прохождению аудита FRESH 
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", 				"ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование",		ОбработкаНаименование);
	ПараметрыРегистрации.Вставить("Версия",				ОбработкаВерсия);
	ПараметрыРегистрации.Вставить("БезопасныйРежим",	БезопасныйРежим);
	ПараметрыРегистрации.Вставить("Информация", 		ОбработкаНаименование);
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");

	
	//Возможность открытия новой формы
	НоваяКоманда = тзКоманд.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'SABY'");
	НоваяКоманда.Идентификатор = "SABY";
	НоваяКоманда.Использование = "ОткрытиеФормы";;
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	НоваяКоманда = тзКоманд.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Выполнить автоматические операции'");
	НоваяКоманда.Идентификатор = "АвтоматическиеОперации";
	НоваяКоманда.Использование = "ВызовСерверногоМетода";
	НоваяКоманда.ПоказыватьОповещение = Истина;
	ПараметрыРегистрации.Вставить("Команды", тзКоманд);
	
	Возврат ПараметрыРегистрации;

КонецФункции
